<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
    <title>用户协议</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        .text-center {
            text-align: center;
        }
        pre {
            white-space: pre-wrap;
            word-wrap: break-word;
        }
    </style>
</head>
<!-- 3. Display the application -->
<body>

<h1 class="text-center">注册协议</h1>
<p class="text-center">（*本文档仅作参考使用，正式纸质协议需双方签章，一式两份，合作关系方可生成立）</p>

<div style="width: 70%;margin: 0 auto">
    <pre>
    甲乙双方本着互惠互利、共同发展的原则，充分发挥各自的优势，在友好协商的基础上，就甲方向乙方提供数字商品计费服务达成如下合作条款：

第一条相关定义
1.1计费服务：指甲方向乙方提供的飞讯无限计费核心系统、商户自服系统、用户自服系统、报表系统等产品及相关配套服务。在本协议中，上述产品和/或服务单独或并称“计费服务”。
1.2销售净收入：指使用甲方计费服务的用户注册、找回密码等短信使用费与销售环节产生的交易金额扣除对应第三方支付通道服务费、退款及坏账后的剩余金额。
1.3可结算销售净收入：指使用甲方计费服务的数字商品产生了销售收入，甲方当月实际从相应的第三方支付通道供应商结算到的金额。
1.4第三方支付通道：指金融机构、第三方支付公司、电信运营商为互联网用户提供的购买消费数字商品的支付工具，第三方支付通道公司按交易金额收取一定比例手续费。
1.5飞讯无限账户：互联网用户在甲方计费服务系统注册的唯一识别编码，乙方可以选择启用飞讯无限账户使乙方用户可用该编码作为身份账户登录乙方应用及交易，飞讯无限账户用户可自行设置密码。
1.6余额：指用户使用第三方支付通道消费的余额，以虚拟币余额形式暂存于飞讯无限账户。
1.7非授权交易：指乙方用户未经过银行卡（含借记卡、信用卡等）持卡人或第三方支付公司账户持有人或者飞讯无限账户持有人授权，使用其银行卡或第三方支付公司账户、飞讯无限账户完成的交易。
1.8退款：指乙方用户的交易被政府有关部门、银行、第三方支付公司、电信运营商认定为非法交易、非授权交易、无效交易时，相关交易款项退回给用户之情形。
1.9异常交易：系指用户或乙方在进行移动支付交易过程中所发生的，违反相关法律法规规定或本协议约定的支付交易行为（包括但不限于洗钱、诈骗、涉黄、涉赌、盗卡、伪卡、信用卡套现等交易行为），或无真实交易背景、与真实交易背景不相符的资金支付行为，客户否认交易或发卡行拒付资金的支付交易行为；或被相关部门和单位调查的支付交易行为；或者采用黑客非法入侵手段获得相关账户权限与资金进行的交易等。
1.10 线下交易：指用户未通过在线方式支付，直接从线下营业厅通过现金方式支付。

第二条合作内容
2.1甲方拥有飞讯无限Wi-Fi计费服务系统（以下简称：计费服务系统），乙方有丰富的Wi-Fi用户资源，经双方沟通一致后达成：乙方使用甲方计费服务系统为乙方的Wi-Fi用户提供前向计费功能，甲方向乙方提供计费服务并按约定比例收取乙方计费服务费。
2.2乙方提供数字商品（Wi-Fi上网时长费用）在交易环节产生的销售净收入由甲方收取后再按约定条件结算给乙方。
2.3乙方负责乙方的Wi-Fi运营推广、技术维护和客服工作。甲方提供计费服务及相关配套支撑服务，若需甲方按人员前往现场协助运营、技术支持和客服工作，需向甲方支付一定服务费用及全程产生的差旅费用。
2.4甲方为乙方提供的Wi-Fi计费服务以在甲方计费服务平台实际接入场所上线为准。

第三条甲方的权利和义务
3.1甲方负责向乙方提供计费服务相关的互联网服务系统及数字商品计费SDK开发工具，并为乙方数字商品的计费接入提供必要的技术支持。
3.2甲方负责建设计费服务系统所需的服务器和网络环境，并保持计费服务系统稳定运行。
3.3甲方须提供计费服务系统商户自服务后台权限给乙方，使乙方能通过商户后台完成价格策略的发布、计费设置、交易管理、收益查询等操作。
3.4甲方在处理用户消费过程中产生疑问、投诉且不能单独处理时，有权要求乙方给予协助解决，乙方应在合理的时间内给予及时回应。
3.5甲方有权根据运营情况决定对计费服务系统的功能和服务进行改动升级，并暂停向乙方提供计费服务，但应至少提前24小时在甲方官网或者用户端收银台公示。
3.6当乙方数字商品发生“异常交易”时，甲方有权对发生异常交易的数字商品暂停提供计费服务并冻结相关资金结算。
3.7甲方仅对乙方提供数字商品计费服务，并不对乙方发布的数字商品版权及授权承担审察义务。
3.8若乙方在甲方计费服务系统平台注册的商户账户连续12个月无交易量时，甲方有权予以注销账户而不承担责任。

第四条乙方的权利和义务
4.1乙方应在本协议签订后在甲方计费服务系统平台注册商户，并妥善保管注册的商户名称及密码。因乙方商户名称和密码保管及使用不当而造成的经济损失由乙方承担全部责任。
4.2乙方自行在甲方计费服务平台增加场所及计费策略，并负责市场推广和运营维护及相关客服工作。
4.3乙方负责基于甲方计费服务系统并依照甲方提供的无线技术规范标准进行施工、调试，完成接入计费系统的工作。(若需要甲方安排技术或商务人员前往现场支持，产生的一切差旅费用由乙方承担)
4.4乙方（包括乙方的员工，其合作机构及其雇员等）不得以任何手段和方式采集、截取、盗用消费者或用户（即持卡人）的银行卡或非银行卡账号及密码等信息；不得代消费者、用户或任何第三方提交订单或发出任何指令。否则，由此产生的一切法律后果由乙方独自承担，甲方可据此终止本协议，并不承担任何责任。
4.5乙方保证在甲方计费服务系统平台发布的数字商品内容健康、合法、不侵害他人知识产权，不违反各项法律条款及各项相应的管理制度，否则一切责任由乙方独立承担。
4.6乙方保证使用甲方计费服务的数字商品严格按照相关法律法规运营，应用内的虚拟币及虚拟物品只能用于用户在应用内消费，且不可兑换为实物或者现金，否则一切责任由乙方独立承担。
4.7乙方有权在使用甲方计费服务的数字商品上使用甲方的商标、名称或其他相关文字、图形及标志。
4.8乙方在发生银行账户信息、经营范围、注册及营业地址、网址变更、联系人及联系方式变更时，应至少提前3天以书面文件加签字的形式通知甲方，否则由此造成的损失由乙方承担。
4.9乙方与甲方合作事项未取得经营许可或者超范围经营造成的一切法律后果均由乙方承担。
4.10 乙方不得以任何原因（不可抗因素除外）的任何形式规劝用户更多使用线下缴费的方式，或以以任何原因（不可抗因素除外）的任何形式规劝用户更少使用在线缴费的方式，如出现此情况甲方有权终止合作，并要求乙方承担由此产生的一切费用。

第五条服务费用
5.1甲乙双方基于用户消费乙方数字商品，并且该数字商品使用甲方提供的计费服务，由此在交易环节产生的毛收入作为甲方向乙方收取计费服务费的基础。
5.2甲方以乙方毛收入的5%，收取乙方的计费服务费。
5.3 乙方测试计费系统产生的费用，由乙方承担。
5.4 甲方通过任何渠道支付体现收入时所产生的手续费用，由乙方承担。

第六条结算
6.1乙方数字商品基于甲方计费服务系统在交易环节产生的销售净收入由甲方收取后再按约定条件结算给乙方，结算时甲方扣取计费服务费。
6.2甲乙双方的结算以甲方计费服务系统平台统计数据为依据（运营商话费支付通道产生的坏账、其他支付通道产生的退款以实际发生的金额进行相应扣除），但甲方须向乙方开放数据平台权限，并共享双方合作产品的真实有效的计费明细和汇总数据，以保证双方利益的公正性。若乙方对结算金额有疑义，则甲方须提供相关对账单或者票据供乙方核实。
6.3甲乙双方约定以一个自然月为一个结算周期对当月可结算销售净收入进行结算，甲方于次月10个工作日前向乙方出具当月电子结算单，乙方确认结算数据后同时开具正式发票寄给甲方，甲方收到发票后5个工作日内将合作款项通过银行转账方式支付到乙方指定账号，银行转账手续费由乙方承担。
6.4乙方还需在纸质协议中指定银行（或支付宝）账号信息并签字确认，在乙方进行本项信息变更时，应向甲方开具签章介绍信说明情况，并说明原因。
6.5乙方当月可结算销售净收入达到1000元后甲方才开始对账结算。若当月可结算销售净收入不足1000元，则当月金额顺延至下一个结算周期结算，以此类推。
6.6在提交结算申请后，如发生账务错误、异常交易、用户投诉未处理完成等方面的情况导致结算无法正常进行的，甲方有权中断结算，直至以上情况处理完成后再恢复结算程序，并重新开始计算结算时间。
6.7延迟结算：如由于电信运营商及第三方支付通道特殊原因造成延迟结算，不作为甲方违约，该部分款项甲乙双方的实际结算则相应推迟，甲方需与乙方沟通后协商解决结算时间及期限。
6.8在本合同有效期内，或在本合同有效期满后两年内，若由于银行卡持卡人向第三方支付公司、银行或者司法机关主张“非授权交易”的消费而要求退款时，乙方须提供用户相应的消费记录供甲方查询。若第三方支付公司、银行或者司法机关判定相关交易无效而须向持卡人退款时，乙方须配合甲方向用户退款。对已交易未结算的交易金额须退款时，该交易金额作为“退款”处理，不进行结算；对已完成结算的交易金额须退款时，乙方在接到甲方通知后5个工作日内将相应金额退回给甲方或者由甲方直接从乙方结算款中扣除（退款情况发生后对于用户在应用内已获得的权益由乙方自行处理）。

第七条合作期限与终止
7.1双方的合作实际期限按纸质协议进行。
7.2若甲乙双方无法就续约问题达成一致意见，则应在合同期满前一个月，由解约意向方书面提出解除合同关系，送达对方后即解除协议。协议期满前三十日内，若任何一方未书面通知对方终止本协议，则本协议自动顺延一年，以此类推。
7.3除法律规定的终止情况外，若甲、乙双方中一方有下列情形之一的，协议另一方有权要求终止协议：拥有的相关从业资格被政府行政部门取消或注销；一方被兼并、购并或进入破产或清算程序；由于发生不可抗力情况，致使无法实现本协议的目的；双方无法履行本合同所规定的义务。

第八条保密条款
8.1甲乙双方有责任对通过该合作业务获得的所有用户资料予以保密。
8.2通过双方合作，一方从另一方（“披露方”）得到的披露方开发、创造、发现的、或为披露方所知的、或转移至该披露方的、对该披露方业务有商业价值的专有信息，包括但不限于有关商业秘密，电脑程序、设计技术、想法、专有技术、数据、业务和产品开发计划，与该披露方业务有关的甲方客户的信息及其他信息，或该披露方从他方收到的保密信息，由信息披露方拥有，未经信息披露方事先书面同意，另一方将对任何专有信息保密，并不使用或向任何人或实体披露这些专有信息，或用于本协议以外的任何目的，但为履行本协议所必须向其职员、咨询顾问等披露的情况除外。
8.3未经信息披露权方事先书面同意，另一方应对任何专有信息保密，并不使用或向任何人或实体披露、给予或转让该等专有信息，但正常履行本协议项下义务需要的除外。本协议终止后，双方仍需承担本协议相关保密义务两年，从本协议终止之日起。
8.4双方对本次合作及本协议的具体内容负有保密责任。未经一方事先书面同意，另一方不得将双方的合作协议的具体内容及其相关内容披露给任何第三方。
8.5除本协议规定之工作及业务所需外，未经对方书面同意，不得擅自使用、复制对方的商标、标志、商业信息、技术及其它数据。

第九条保证条款
9.1双方互相向对方声明、陈述和保证如下：其是合法设立并有效存续的独立法人；其有资格从事本协议项下之合作，而该合作符合其经营范围之规定；其授权代表已获得充分授权可代表其签署本协议；其有能力履行其于本协议项下之义务，并且该等履行义务的行为不违反任何对其有约束力的法律限制。
9.2乙方的推广渠道和推广方式须正规合法，保证推广渠道中无任何色情、暴力、低俗诱导、封建迷信等违法和低俗信息，不链接非法和违规站点，如因此给甲方造成任何损失，乙方应负责全额赔偿。
9.3乙方保证：其使用甲方计费服务的数字商品拥有完整版权或其它合法权利。

第十条违约责任
10.1任何一方没有充分、及时履行义务的，应当承担违约责任；给其他方造成损失的，应赔偿其他方由此所遭受的直接经济损失。
10.2任何一方在收到对方关于违约的具体说明的书面通知后，如承认违约行为实际存在，则应在二十日内对违约行为予以纠正并书面通知对方，同时按本协议的相关规定承担相应责任；如认为不存在违约行为，则应在收到对方关于违约的具体说明的书面通知后二十日内向对方提出书面异议或说明。在此情况下，双方可以就此问题进行协商，协商不成的，按本协议争议条款解决，由违约方承担因自己的违约行为给守约方造成的经济损失。
10.3本协议有效期内及本协议终止或者解除后，甲乙双方承诺不向任何第三方（包括但不限于与对方构成商业竞争关系的企业、商业机构或者组织）提供有关双方业务、技术等一切相关信息或者资料，否则由违约方承担相应的责任，并赔偿守约方因此造成的经济损失。

第十一条免责条款
11.1由于第三方支付通道暂停服务或终止合作，甲方有权对计费服务系统对应通道进行相应的调整或者关闭，但应至少提前24小时在甲方官网或者用户端收银台公示，并不承担因此调整给乙方带来的损失。
11.2由于第三方支付通道进行系统维护或者系统故障而导致无法支付，甲方不承担任何责任。但甲方需与该支付通道积极协调以尽快恢复支付业务。
11.3由于发生不能预见、不可避免并且对发生的后果不能克服的不可抗力事件（包括战争、自然灾害、移动运营商的政策调整和国家政策法律法规的调整在内），致使一方遭受经济损失或致使本协议不能履行或不能完全履行时，一方对另一方的损失不承担责任。遇有上述不可抗力事件的一方，应立即将事件情况书面通知对方，并应于20日内向对方提出事件详情及协议不能履行或不能完全履行、或需要延期履行的理由的有效证明文件。按照事件对协议履行的影响程度，由双方协商决定是否继续履行本协议或终止协议。
11.4由于运营商的系统故障、电信通道阻滞、黑客袭击或非法侵入、计算机、病毒感染或发作、以及同样维护保养仍未能避免的硬件和软件故障，以及电力供应或其他公用设备的中断而导致的系统运转中断、故障、信息传输错误、遗漏或其他问题而引起的责任，甲方不承担责任。

第十二条通知
12.1双方之间的任何通知或书面函件必须以中文写成，以电话通知、专人送达（包括特快专递）或电子邮件形式发送。
12.2除非事先以书面通知更改，所有通知及函件均应发往下列恰当之通讯地址：
    
甲方	武汉飞讯无限网络技术有限公司
地址	武汉市江夏区纸坊街道西港街64号3楼     

12.3通知若为电子邮件形式，则邮件进入收件方指定之电子邮件系统的时间即视为已送达；若为专人派送时(包括特快专递)，按收件一方签收之日期为准。

第十三条争议解决与适用法律
13.1如甲乙双方就本协议内容或其执行发生任何争议，甲乙双方应进行友好协商；协商不成时，任何一方均可向武汉市江夏区人民法院提起诉讼。
13.2本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。

第十四条其它条款
14.1本协议的任何一方未能及时行使本协议项下的权利不应被视为放弃该权利，也不影响该方在将来行使该权利。
14.2如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款视为删除，但本协议的其余条款在不影响协议目的的情况下仍应有效并且有约束力。
14.3本协议经甲乙双方加盖有效印章后立即生效。
14.4本协议正本一式肆份，双方各执贰份，具有同等法律效力。
14.5本协议的附件是本协议不可分割的组成部分，与本协议具有同等法律效力。
14.6本协议未尽事宜，双方可签订补充协议或以附件的形式对本协议中的有关问题作出补充、说明和解释。
（本行以下无正文）


    </pre>
</div>


</body>
</html>